Ethan-Hang/stm32-platform-refactor/03_Firmware/00_Bootloader/Middlewares/Ymodem/src/ymodem.c
        // Update tracking variables
        FlashDestination += bytes_to_copy;
        ctx->bytes_received += bytes_to_copy;

        // Calculate and display progress (integer math, no float)
        uint32_t progress_percent = (ctx->bytes_received * 100) / ctx->size;
        DEBUG_OUT(i, YMODEM_FILE_DATA_LOG_TAG, "Progress: %d/%d bytes (%d%%)",
                  ctx->bytes_received, ctx->size, progress_percent);
    }

    Send_Byte(ACK);
    return (int32_t)YMODEM_RX_HANDLER_CONTINUE;
}

/**
* @brief Receive a file via Ymodem and stage it into W25Q64 BLOCK_1.
*
* Driver-style outer loop around the FSM (FileInfo → FileData). Handles
* per-packet ACK/NAK, the Ymodem double-EOT trick, and the trailing
* zero-length filename packet that closes the session.
*
* @param[out] buf : caller buffer pointer; currently only kept in ctx for
*                   debug printing — actual payload goes straight into the
*                   external SPI NOR via W25Q64_WriteData(), not into buf.
*
* @return >0   on success: number of bytes accepted into staging (ctx.bytes_received)
*         0    YMODEM_RX_ABORTED  remote sent CA CA  (NOTE: collides numerically
*                                  with YMODEM_RX_TIMEOUT_ERR — see enum in
*                                  ymodem.h; caller cannot distinguish them)
*         0    YMODEM_RX_TIMEOUT_ERR  3 consecutive packet errors → bail
*         -1   YMODEM_RX_SIZE_ERR     image bigger than INTER_FLASH_SIZE
*         -2   YMODEM_RX_FLASH_ERR    W25Q64 finalize-flush failed
*         -3   YMODEM_RX_USER_ABORT   user pressed 'A' / 'a' on sender side
* */
int32_t Ymodem_Receive(uint8_t *buf)
{
    Ymodem_RxContext_t ctx;
    /**
    * FSM dispatch table — index by ctx.state (Ymodem_RxState_t). Adding a
    * state means appending a handler here and extending the enum in lockstep.
    **/
    int32_t (*state_handlers[])(Ymodem_RxContext_t *) = {
        Ymodem_RxState_FileInfo, /* YMODEM_RX_STATE_FILE_INFO */
        Ymodem_RxState_FileData  /* YMODEM_RX_STATE_FILE_DATA */
    };
    int32_t rx_result;
    int32_t state_result;

    /* Initialize context */
    ctx.buf              = buf;
    ctx.buf_ptr          = buf;
    ctx.size             = 0;
    ctx.bytes_received   = 0;
    ctx.errors           = 0;
    ctx.session_done     = 0;
    ctx.packets_received = 0;
    /**
    * session_begin gates error counting: timeouts before the very first
    * valid packet should not count toward MAX_ERRORS, because the receiver
    * is the one driving handshake (it spams 'C' to invite a sender), and
    * the sender may legitimately take a few seconds to react.
    **/
    ctx.session_begin    = 0;
    ctx.state            = YMODEM_RX_STATE_FILE_INFO;

    /**
    * Staging cursor (internal-flash semantics) — kept as a legacy global for
    * the commented-out internal-flash path; current code writes through
    * W25Q64_WriteData() instead, so this is effectively only used for
    * bookkeeping/log lines.
    **/
    FlashDestination     = BackAppAddress;

    DEBUG_OUT(i, YMODEM_LOG_TAG, "Starting reception... (buf @0x%08x)",
              (uint32_t)buf);

    while (1)
    {
        for (ctx.packets_received = 0, ctx.file_done = 0, ctx.buf_ptr = buf;;)
        {
            rx_result = Receive_Packet(ctx.packet_data, &ctx.packet_length,
                                       NAK_TIMEOUT);

            switch (rx_result)
            {
            case YMODEM_PKT_SUCCESS:
                /* Packet received successfully */
                ctx.errors = 0;
                switch (ctx.packet_length)
                {
                /* Abort by sender */
                case -1:
                    Send_Byte(ACK);
                    return (int32_t)YMODEM_RX_ABORTED;
                /**
                * length == 0 means EOT byte was seen. Ymodem requires the
                * sender to transmit EOT twice (once NAK'd, then ACK'd) to
                * disambiguate from line noise — we collapse that here by
                * using the FSM state as a 2-step counter: first EOT in
                * FILE_DATA flips us back to FILE_INFO, second EOT in
                * FILE_INFO closes the session.
                **/
                case 0:
                    Send_Byte(ACK);
                    if (ctx.state == YMODEM_RX_STATE_FILE_DATA)
                    {
                        /* First EOT: transition back to FILE_INFO for EOF
                         * packet */
                        ctx.state     = YMODEM_RX_STATE_FILE_INFO;
                        ctx.file_done = 1;
                        DEBUG_OUT(d, YMODEM_LOG_TAG,
                                  "EOT received, waiting for EOF packet...");
                    }
                    else if (ctx.state == YMODEM_RX_STATE_FILE_INFO)
                    {
                        /* Second EOT or EOF packet received, end session */
                        ctx.file_done    = 1;
                        ctx.session_done = 1;
                        DEBUG_OUT(i, YMODEM_LOG_TAG,
                                  "Session complete, file transfer successful");
                    }
                    break;
                /* Normal packet */
                default:
                {
                    /**
                    * Compare against expected SEQ. Sender numbers packets
                    * 1, 2, 3, ... wrapping mod 256. Receiver counts packets
                    * starting at 0 (block 0 = filename), so the modulo of
                    * packets_received gives the expected number for the
                    * next packet.
                    **/
                    uint8_t pkt_seqno =
                        ctx.packet_data[PACKET_SEQNO_INDEX] & 0xff;
                    uint8_t exp_seqno = ctx.packets_received & 0xff;

                    /* Debug: Print sequence number */
                    DEBUG_OUT(d, YMODEM_PACKET_LOG_TAG, "Seqno: %d Expected: %d", pkt_seqno,
                              exp_seqno);

                    if (pkt_seqno != exp_seqno)
                    {
                        /**
                        * SEQ mismatch usually means the previous ACK was
                        * lost and sender re-sent the prior block. NAK asks
                        * sender to retransmit; do NOT advance the counter.
                        **/
                        DEBUG_OUT(w, YMODEM_PACKET_LOG_TAG,
                                  "Sequence mismatch, sending NAK");
                        Send_Byte(NAK);
                    }
                    else
                    {
                        /* Call state handler function pointer */
                        state_result = state_handlers[ctx.state](&ctx);
                        if (state_result == (int32_t)YMODEM_RX_HANDLER_ERROR)
                        {
                            return state_result;
                        }
                        if (state_result == (int32_t)YMODEM_RX_HANDLER_DONE)
                        {
                            /* State handler indicates completion */
                            break;
                        }
                        /* YMODEM_RX_HANDLER_CONTINUE: proceed normally */

                        ctx.packets_received++;
                        ctx.session_begin = 1;
                    }
                }
                }
                break;
            case YMODEM_PKT_ABORT:
                /* User abort */
                Send_Byte(CA);
                Send_Byte(CA);
                return (int32_t)YMODEM_RX_USER_ABORT;
            case YMODEM_PKT_TIMEOUT:
            default:
                /**
                * Pre-session timeouts (no valid packet seen yet) are normal —
                * we're just spamming 'C' to wake the sender — so don't count
                * them against MAX_ERRORS. After the first successful packet,
                * every timeout is a real problem.
                **/
                if (ctx.session_begin > 0)
                {
                    ctx.errors++;
                    DEBUG_OUT(w, YMODEM_ERROR_LOG_TAG, "Timeout/Error, count: %d/%d",
                              ctx.errors, MAX_ERRORS);
                }
                if (ctx.errors > MAX_ERRORS)
                {
                    DEBUG_OUT(e, YMODEM_ERROR_LOG_TAG, "Max errors exceeded!");
                    Send_Byte(CA);
                    Send_Byte(CA);
                    return (int32_t)YMODEM_RX_TIMEOUT_ERR;
                }
                /**
                * Send 'C' (not NAK) to re-invite the sender — this keeps the
                * link in CRC16 mode rather than falling back to checksum.
                **/
                Send_Byte(CRC16);
                break;
            }
            if (ctx.file_done != 0)
            {
                break;
            }
        }
        if (ctx.session_done != 0)
        {
            break;
        }

        /**
        * Reached after first EOT (file_done=1, session_done=0). Re-arm the
        * inner loop to receive the trailing empty-filename block 0 that
        * marks end-of-session. The `session_done == 0` test is redundant
        * with the break above but kept for readability.
        **/
        if (ctx.file_done != 0 && ctx.session_done == 0)
        {
            Send_Byte(CRC16);  /* Request next packet */
            ctx.file_done = 0; /* Reset to allow new file processing */
            ctx.errors    = 0; /* Reset error count for new packet reception */
            DEBUG_OUT(d, YMODEM_LOG_TAG, "Requesting next packet with CRC16...");
        }
    }

